docs/jmeter.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">60</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Spring Boot - POST" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;name&quot;: &quot;${__RandomString(${__Random(5,20)}, ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz)}&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">spendingbetter.com</stringProp>
          <stringProp name="HTTPSampler.port">8081</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/api/posts</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer eyJhbGciOiJSUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiJhZG1pbkBnbWFpbC5jb20iLCJhdXRoIjoiUk9MRV9BRE1JTiIsInVzZXJfbmFtZSI6ImFkbWluQGdtYWlsLmNvbSIsImlzcyI6Imh0dHBzOi8vc3BlbmRpbmdiZXR0ZXIuY29tIiwidHlwZSI6ImFjY2VzcyIsImF1dGhvcml0aWVzIjpbIlJPTEVfQURNSU4iXSwiY2xpZW50X2lkIjoiYWRtaW5AZ21haWwuY29tIiwiYXVkIjoiaHR0cHM6Ly9zcGVuZGluZ2JldHRlci5jb20iLCJuYmYiOjE2NDkxODI0ODUsInNjb3BlIjpbInJlYWQiXSwiZXhwIjoxNjQ5MTg0Mjg1LCJmcmVzaCI6dHJ1ZSwiaWF0IjoxNjQ5MTgyNDg1LCJqdGkiOiI0ODlkYmMyNi1jZDcwLTQxY2UtYTlmNS1iZjZlMTllY2M1N2UifQ.F5cdvwq_kwYF7cnZ66nMrYEjQde5NGNDVHVKIK8TfMfSlC2vtX5ydfzyuOo-HWOV3hNIQtZJWw7Pe32dfA76SsK7O59V7S-rplzZm-1KWsIPMQAez_F3ABtEv7yU3hKQPIBedhp8BLspAda8YEtbf7gOE-sZ4ozo2iNMZzx6GA-9M0na24saZW2W12AoAomiuyXfU3sM0bRDGWsIG91rTqKaB1dgGwdCKsfVJd17JlrFr3mC4kBtl8xw3dY-CV4jEzIEizQHg0jFPl0xaCSV2yYkUiT44u5RPEzkn4LO3Z7rinQKIK55U7HSzA15jk2Siis_mONwJ_PVrUftNZoSNg</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Quarkus - GET" enabled="false">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">MINIKUBE_IP</stringProp>
          <stringProp name="HTTPSampler.port">INGRESS_PORT</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/quarkus/api/companies/</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer eyJraWQiOiJ0ZXN0IiwidHlwIjoiSldUIiwiYWxnIjoiUlMyNTYifQ.eyJzdWIiOiJ0ZXN0IiwibmJmIjoxNTkwMTg1NDkxLCJzY29wZSI6InJlYWQiLCJpc3MiOiJqd3QiLCJleHAiOjE1OTAyNzE4OTEsImlhdCI6MTU5MDE4NTQ5MSwiYXV0aG9yaXRpZXMiOlsiUk9MRV9BRE1JTiJdLCJqdGkiOiJiNGJkZWI4OS01NTRmLTRkMmItYmE2NS1kNmQ1YzUxMDJlOTIifQ.K0Y2t5yHNLi169FUWZZwK5HnRCLoAnmrIWBfyMVfcqBZTKNvQbQdvSwOsLkkSW1uNd93Xpxl5LOI5KWT2JvrNOiqMwYZANo-J5bPtM59Av5V0k5mwukrYda_nz90PeIIkNvTTN6a5uNPLMwdVimWMDneGOK7alnwu9TRzAMh3UFyzq6gEpZH2YIHu8abG7YibN7kUMn799l23CmjeRjKiV1nxJBaZRUzH4aCLIA8j0Dr60ZsEuZX4ZrHfDy-fPAavP4YP-R5v-AwsOEye1_ihF0NQZtGQ-WRlWmSDU9itfF8abxHh9JT1pXIJOjVlwW7GIT9ysOrydc3gRAHThI5Ig</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">test_result_springboot</stringProp>
        </ResultCollector>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Spring Boot - POST" enabled="false">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
	&quot;name&quot;: &quot;spring boot - test jmeter - ${__UUID()}&quot;, &#xd;
	&quot;activated&quot;: true&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">MINIKUBE_IP</stringProp>
          <stringProp name="HTTPSampler.port">INGRESS_PORT</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/companies/</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer eyJraWQiOiJ0ZXN0IiwidHlwIjoiSldUIiwiYWxnIjoiUlMyNTYifQ.eyJzdWIiOiJ0ZXN0IiwibmJmIjoxNTkwMTg1NDkxLCJzY29wZSI6InJlYWQiLCJpc3MiOiJqd3QiLCJleHAiOjE1OTAyNzE4OTEsImlhdCI6MTU5MDE4NTQ5MSwiYXV0aG9yaXRpZXMiOlsiUk9MRV9BRE1JTiJdLCJqdGkiOiJiNGJkZWI4OS01NTRmLTRkMmItYmE2NS1kNmQ1YzUxMDJlOTIifQ.K0Y2t5yHNLi169FUWZZwK5HnRCLoAnmrIWBfyMVfcqBZTKNvQbQdvSwOsLkkSW1uNd93Xpxl5LOI5KWT2JvrNOiqMwYZANo-J5bPtM59Av5V0k5mwukrYda_nz90PeIIkNvTTN6a5uNPLMwdVimWMDneGOK7alnwu9TRzAMh3UFyzq6gEpZH2YIHu8abG7YibN7kUMn799l23CmjeRjKiV1nxJBaZRUzH4aCLIA8j0Dr60ZsEuZX4ZrHfDy-fPAavP4YP-R5v-AwsOEye1_ihF0NQZtGQ-WRlWmSDU9itfF8abxHh9JT1pXIJOjVlwW7GIT9ysOrydc3gRAHThI5Ig</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Quarkus - POST" enabled="false">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
	&quot;name&quot;: &quot;quarkus - test jmeter - ${__UUID()}&quot;, &#xd;
	&quot;activated&quot;: true&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">MINIKUBE_IP</stringProp>
          <stringProp name="HTTPSampler.port">INGRESS_PORT</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/quarkus/api/companies/</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer eyJraWQiOiJ0ZXN0IiwidHlwIjoiSldUIiwiYWxnIjoiUlMyNTYifQ.eyJzdWIiOiJ0ZXN0IiwibmJmIjoxNTkwMTg1NDkxLCJzY29wZSI6InJlYWQiLCJpc3MiOiJqd3QiLCJleHAiOjE1OTAyNzE4OTEsImlhdCI6MTU5MDE4NTQ5MSwiYXV0aG9yaXRpZXMiOlsiUk9MRV9BRE1JTiJdLCJqdGkiOiJiNGJkZWI4OS01NTRmLTRkMmItYmE2NS1kNmQ1YzUxMDJlOTIifQ.K0Y2t5yHNLi169FUWZZwK5HnRCLoAnmrIWBfyMVfcqBZTKNvQbQdvSwOsLkkSW1uNd93Xpxl5LOI5KWT2JvrNOiqMwYZANo-J5bPtM59Av5V0k5mwukrYda_nz90PeIIkNvTTN6a5uNPLMwdVimWMDneGOK7alnwu9TRzAMh3UFyzq6gEpZH2YIHu8abG7YibN7kUMn799l23CmjeRjKiV1nxJBaZRUzH4aCLIA8j0Dr60ZsEuZX4ZrHfDy-fPAavP4YP-R5v-AwsOEye1_ihF0NQZtGQ-WRlWmSDU9itfF8abxHh9JT1pXIJOjVlwW7GIT9ysOrydc3gRAHThI5Ig</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>